---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Architecture.RailingType
source: html/19bda8b3-8832-89ed-93db-b8100946ae30.htm
---
# RailingType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.